Revit 2027 API
FabricationHostedInfo.HostId Property
 Returns the identifier of the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostId { get; }
Public ReadOnly Property HostId As ElementId
	Get
public:
property ElementId^ HostId {
	ElementId^ get ();
}
member HostId : ElementId with get
Property Value
ElementId
See Also
Reference
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace